grevaillot/svd_tools/headers/ATSAM4SD16C/tc0.h
#define TC0_CMR0_WAVEFORM_MODE_BSWTRG_SHIFT		30
#define TC0_CMR0_WAVEFORM_MODE_BSWTRG_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_BEEVT_SHIFT		28
#define TC0_CMR0_WAVEFORM_MODE_BEEVT_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_BCPC_SHIFT		26
#define TC0_CMR0_WAVEFORM_MODE_BCPC_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_BCPB_SHIFT		24
#define TC0_CMR0_WAVEFORM_MODE_BCPB_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_ASWTRG_SHIFT		22
#define TC0_CMR0_WAVEFORM_MODE_ASWTRG_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_AEEVT_SHIFT		20
#define TC0_CMR0_WAVEFORM_MODE_AEEVT_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_ACPC_SHIFT		18
#define TC0_CMR0_WAVEFORM_MODE_ACPC_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_ACPA_SHIFT		16
#define TC0_CMR0_WAVEFORM_MODE_ACPA_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC0_CMR0_WAVEFORM_MODE_WAVE Waveform Mode **/
#define TC0_CMR0_WAVEFORM_MODE_WAVE		(1 << 15)

#define TC0_CMR0_WAVEFORM_MODE_WAVSEL_SHIFT		13
#define TC0_CMR0_WAVEFORM_MODE_WAVSEL_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVEFORM_MODE_ENETRG External Event Trigger Enable **/
#define TC0_CMR0_WAVEFORM_MODE_ENETRG		(1 << 12)

#define TC0_CMR0_WAVEFORM_MODE_EEVT_SHIFT		10
#define TC0_CMR0_WAVEFORM_MODE_EEVT_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC0_CMR0_WAVEFORM_MODE_EEVTEDG_SHIFT		8
#define TC0_CMR0_WAVEFORM_MODE_EEVTEDG_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVEFORM_MODE_CPCDIS Counter Clock Disable with RC Compare **/
#define TC0_CMR0_WAVEFORM_MODE_CPCDIS		(1 << 7)
/** TC0_CMR0_WAVEFORM_MODE_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC0_CMR0_WAVEFORM_MODE_CPCSTOP		(1 << 6)

#define TC0_CMR0_WAVEFORM_MODE_BURST_SHIFT		4
#define TC0_CMR0_WAVEFORM_MODE_BURST_MASK		0x03
/** @defgroup tc0_cmr0_waveform_mode_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVEFORM_MODE_CLKI Clock Invert **/
#define TC0_CMR0_WAVEFORM_MODE_CLKI		(1 << 3)

#define TC0_CMR0_WAVEFORM_MODE_TCCLKS_SHIFT		0
#define TC0_CMR0_WAVEFORM_MODE_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr0_waveform_mode_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_smmr0 SMMR0 Stepper Motor Mode Register (channel = 0)
@{*/

/** TC0_SMMR0_DOWN Down Count **/
#define TC0_SMMR0_DOWN		(1 << 1)
/** TC0_SMMR0_GCEN Gray Count Enable **/
#define TC0_SMMR0_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cv0 CV0 Counter Value (channel = 0)
@{*/


#define TC0_CV0_CV_SHIFT		0
#define TC0_CV0_CV_MASK		0xffffffff
/** @defgroup tc0_cv0_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_ra0 RA0 Register A (channel = 0)
@{*/


#define TC0_RA0_RA_SHIFT		0
#define TC0_RA0_RA_MASK		0xffffffff
/** @defgroup tc0_ra0_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rb0 RB0 Register B (channel = 0)
@{*/


#define TC0_RB0_RB_SHIFT		0
#define TC0_RB0_RB_MASK		0xffffffff
/** @defgroup tc0_rb0_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rc0 RC0 Register C (channel = 0)
@{*/


#define TC0_RC0_RC_SHIFT		0
#define TC0_RC0_RC_MASK		0xffffffff
/** @defgroup tc0_rc0_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_sr0 SR0 Status Register (channel = 0)
@{*/

/** TC0_SR0_MTIOB TIOB Mirror **/
#define TC0_SR0_MTIOB		(1 << 18)
/** TC0_SR0_MTIOA TIOA Mirror **/
#define TC0_SR0_MTIOA		(1 << 17)
/** TC0_SR0_CLKSTA Clock Enabling Status **/
#define TC0_SR0_CLKSTA		(1 << 16)
/** TC0_SR0_ETRGS External Trigger Status (cleared on read) **/
#define TC0_SR0_ETRGS		(1 << 7)
/** TC0_SR0_LDRBS RB Loading Status (cleared on read) **/
#define TC0_SR0_LDRBS		(1 << 6)
/** TC0_SR0_LDRAS RA Loading Status (cleared on read) **/
#define TC0_SR0_LDRAS		(1 << 5)
/** TC0_SR0_CPCS RC Compare Status (cleared on read) **/
#define TC0_SR0_CPCS		(1 << 4)
/** TC0_SR0_CPBS RB Compare Status (cleared on read) **/
#define TC0_SR0_CPBS		(1 << 3)
/** TC0_SR0_CPAS RA Compare Status (cleared on read) **/
#define TC0_SR0_CPAS		(1 << 2)
/** TC0_SR0_LOVRS Load Overrun Status (cleared on read) **/
#define TC0_SR0_LOVRS		(1 << 1)
/** TC0_SR0_COVFS Counter Overflow Status (cleared on read) **/
#define TC0_SR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ier0 IER0 Interrupt Enable Register (channel = 0)
@{*/

/** TC0_IER0_ETRGS External Trigger **/
#define TC0_IER0_ETRGS		(1 << 7)
/** TC0_IER0_LDRBS RB Loading **/
#define TC0_IER0_LDRBS		(1 << 6)
/** TC0_IER0_LDRAS RA Loading **/
#define TC0_IER0_LDRAS		(1 << 5)
/** TC0_IER0_CPCS RC Compare **/
#define TC0_IER0_CPCS		(1 << 4)
/** TC0_IER0_CPBS RB Compare **/
#define TC0_IER0_CPBS		(1 << 3)
/** TC0_IER0_CPAS RA Compare **/
#define TC0_IER0_CPAS		(1 << 2)
/** TC0_IER0_LOVRS Load Overrun **/
#define TC0_IER0_LOVRS		(1 << 1)
/** TC0_IER0_COVFS Counter Overflow **/
#define TC0_IER0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_idr0 IDR0 Interrupt Disable Register (channel = 0)
@{*/

/** TC0_IDR0_ETRGS External Trigger **/
#define TC0_IDR0_ETRGS		(1 << 7)
/** TC0_IDR0_LDRBS RB Loading **/
#define TC0_IDR0_LDRBS		(1 << 6)
/** TC0_IDR0_LDRAS RA Loading **/
#define TC0_IDR0_LDRAS		(1 << 5)
/** TC0_IDR0_CPCS RC Compare **/
#define TC0_IDR0_CPCS		(1 << 4)
/** TC0_IDR0_CPBS RB Compare **/
#define TC0_IDR0_CPBS		(1 << 3)
/** TC0_IDR0_CPAS RA Compare **/
#define TC0_IDR0_CPAS		(1 << 2)
/** TC0_IDR0_LOVRS Load Overrun **/
#define TC0_IDR0_LOVRS		(1 << 1)
/** TC0_IDR0_COVFS Counter Overflow **/
#define TC0_IDR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_imr0 IMR0 Interrupt Mask Register (channel = 0)
@{*/

