grevaillot/svd_tools/headers/ATSAM4SD16C/tc0.h
/** TC0_IMR0_ETRGS External Trigger **/
#define TC0_IMR0_ETRGS		(1 << 7)
/** TC0_IMR0_LDRBS RB Loading **/
#define TC0_IMR0_LDRBS		(1 << 6)
/** TC0_IMR0_LDRAS RA Loading **/
#define TC0_IMR0_LDRAS		(1 << 5)
/** TC0_IMR0_CPCS RC Compare **/
#define TC0_IMR0_CPCS		(1 << 4)
/** TC0_IMR0_CPBS RB Compare **/
#define TC0_IMR0_CPBS		(1 << 3)
/** TC0_IMR0_CPAS RA Compare **/
#define TC0_IMR0_CPAS		(1 << 2)
/** TC0_IMR0_LOVRS Load Overrun **/
#define TC0_IMR0_LOVRS		(1 << 1)
/** TC0_IMR0_COVFS Counter Overflow **/
#define TC0_IMR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ccr1 CCR1 Channel Control Register (channel = 1)
@{*/

/** TC0_CCR1_SWTRG Software Trigger Command **/
#define TC0_CCR1_SWTRG		(1 << 2)
/** TC0_CCR1_CLKDIS Counter Clock Disable Command **/
#define TC0_CCR1_CLKDIS		(1 << 1)
/** TC0_CCR1_CLKEN Counter Clock Enable Command **/
#define TC0_CCR1_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cmr1 CMR1 Channel Mode Register (channel = 1)
@{*/


#define TC0_CMR1_LDRB_SHIFT		18
#define TC0_CMR1_LDRB_MASK		0x03
/** @defgroup tc0_cmr1_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC0_CMR1_LDRA_SHIFT		16
#define TC0_CMR1_LDRA_MASK		0x03
/** @defgroup tc0_cmr1_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC0_CMR1_WAVE Waveform Mode **/
#define TC0_CMR1_WAVE		(1 << 15)
/** TC0_CMR1_CPCTRG RC Compare Trigger Enable **/
#define TC0_CMR1_CPCTRG		(1 << 14)
/** TC0_CMR1_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC0_CMR1_ABETRG		(1 << 10)

#define TC0_CMR1_ETRGEDG_SHIFT		8
#define TC0_CMR1_ETRGEDG_MASK		0x03
/** @defgroup tc0_cmr1_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC0_CMR1_LDBDIS Counter Clock Disable with RB Loading **/
#define TC0_CMR1_LDBDIS		(1 << 7)
/** TC0_CMR1_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC0_CMR1_LDBSTOP		(1 << 6)

#define TC0_CMR1_BURST_SHIFT		4
#define TC0_CMR1_BURST_MASK		0x03
/** @defgroup tc0_cmr1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR1_CLKI Clock Invert **/
#define TC0_CMR1_CLKI		(1 << 3)

#define TC0_CMR1_TCCLKS_SHIFT		0
#define TC0_CMR1_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_cmr1_waveform_mode CMR1WAVEFORMMODE Channel Mode Register (channel = 1)
@{*/


#define TC0_CMR1_WAVEFORM_MODE_BSWTRG_SHIFT		30
#define TC0_CMR1_WAVEFORM_MODE_BSWTRG_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_BEEVT_SHIFT		28
#define TC0_CMR1_WAVEFORM_MODE_BEEVT_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_BCPC_SHIFT		26
#define TC0_CMR1_WAVEFORM_MODE_BCPC_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_BCPB_SHIFT		24
#define TC0_CMR1_WAVEFORM_MODE_BCPB_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_ASWTRG_SHIFT		22
#define TC0_CMR1_WAVEFORM_MODE_ASWTRG_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_AEEVT_SHIFT		20
#define TC0_CMR1_WAVEFORM_MODE_AEEVT_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_ACPC_SHIFT		18
#define TC0_CMR1_WAVEFORM_MODE_ACPC_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_ACPA_SHIFT		16
#define TC0_CMR1_WAVEFORM_MODE_ACPA_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC0_CMR1_WAVEFORM_MODE_WAVE Waveform Mode **/
#define TC0_CMR1_WAVEFORM_MODE_WAVE		(1 << 15)

#define TC0_CMR1_WAVEFORM_MODE_WAVSEL_SHIFT		13
#define TC0_CMR1_WAVEFORM_MODE_WAVSEL_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC0_CMR1_WAVEFORM_MODE_ENETRG External Event Trigger Enable **/
#define TC0_CMR1_WAVEFORM_MODE_ENETRG		(1 << 12)

#define TC0_CMR1_WAVEFORM_MODE_EEVT_SHIFT		10
#define TC0_CMR1_WAVEFORM_MODE_EEVT_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC0_CMR1_WAVEFORM_MODE_EEVTEDG_SHIFT		8
#define TC0_CMR1_WAVEFORM_MODE_EEVTEDG_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC0_CMR1_WAVEFORM_MODE_CPCDIS Counter Clock Disable with RC Compare **/
#define TC0_CMR1_WAVEFORM_MODE_CPCDIS		(1 << 7)
/** TC0_CMR1_WAVEFORM_MODE_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC0_CMR1_WAVEFORM_MODE_CPCSTOP		(1 << 6)

#define TC0_CMR1_WAVEFORM_MODE_BURST_SHIFT		4
#define TC0_CMR1_WAVEFORM_MODE_BURST_MASK		0x03
/** @defgroup tc0_cmr1_waveform_mode_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR1_WAVEFORM_MODE_CLKI Clock Invert **/
#define TC0_CMR1_WAVEFORM_MODE_CLKI		(1 << 3)

#define TC0_CMR1_WAVEFORM_MODE_TCCLKS_SHIFT		0
#define TC0_CMR1_WAVEFORM_MODE_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr1_waveform_mode_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_smmr1 SMMR1 Stepper Motor Mode Register (channel = 1)
@{*/

/** TC0_SMMR1_DOWN Down Count **/
#define TC0_SMMR1_DOWN		(1 << 1)
/** TC0_SMMR1_GCEN Gray Count Enable **/
#define TC0_SMMR1_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cv1 CV1 Counter Value (channel = 1)
@{*/


#define TC0_CV1_CV_SHIFT		0
#define TC0_CV1_CV_MASK		0xffffffff
/** @defgroup tc0_cv1_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_ra1 RA1 Register A (channel = 1)
@{*/


#define TC0_RA1_RA_SHIFT		0
#define TC0_RA1_RA_MASK		0xffffffff
/** @defgroup tc0_ra1_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rb1 RB1 Register B (channel = 1)
@{*/


#define TC0_RB1_RB_SHIFT		0
#define TC0_RB1_RB_MASK		0xffffffff
/** @defgroup tc0_rb1_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rc1 RC1 Register C (channel = 1)
@{*/


#define TC0_RC1_RC_SHIFT		0
#define TC0_RC1_RC_MASK		0xffffffff
/** @defgroup tc0_rc1_rc RC Register C
@{*/
/**@}*/


/**@}*/

