grevaillot/svd_tools/headers/ATSAM4SD16C/tc0.h
/** @defgroup tc0_sr1 SR1 Status Register (channel = 1)
@{*/

/** TC0_SR1_MTIOB TIOB Mirror **/
#define TC0_SR1_MTIOB		(1 << 18)
/** TC0_SR1_MTIOA TIOA Mirror **/
#define TC0_SR1_MTIOA		(1 << 17)
/** TC0_SR1_CLKSTA Clock Enabling Status **/
#define TC0_SR1_CLKSTA		(1 << 16)
/** TC0_SR1_ETRGS External Trigger Status (cleared on read) **/
#define TC0_SR1_ETRGS		(1 << 7)
/** TC0_SR1_LDRBS RB Loading Status (cleared on read) **/
#define TC0_SR1_LDRBS		(1 << 6)
/** TC0_SR1_LDRAS RA Loading Status (cleared on read) **/
#define TC0_SR1_LDRAS		(1 << 5)
/** TC0_SR1_CPCS RC Compare Status (cleared on read) **/
#define TC0_SR1_CPCS		(1 << 4)
/** TC0_SR1_CPBS RB Compare Status (cleared on read) **/
#define TC0_SR1_CPBS		(1 << 3)
/** TC0_SR1_CPAS RA Compare Status (cleared on read) **/
#define TC0_SR1_CPAS		(1 << 2)
/** TC0_SR1_LOVRS Load Overrun Status (cleared on read) **/
#define TC0_SR1_LOVRS		(1 << 1)
/** TC0_SR1_COVFS Counter Overflow Status (cleared on read) **/
#define TC0_SR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ier1 IER1 Interrupt Enable Register (channel = 1)
@{*/

/** TC0_IER1_ETRGS External Trigger **/
#define TC0_IER1_ETRGS		(1 << 7)
/** TC0_IER1_LDRBS RB Loading **/
#define TC0_IER1_LDRBS		(1 << 6)
/** TC0_IER1_LDRAS RA Loading **/
#define TC0_IER1_LDRAS		(1 << 5)
/** TC0_IER1_CPCS RC Compare **/
#define TC0_IER1_CPCS		(1 << 4)
/** TC0_IER1_CPBS RB Compare **/
#define TC0_IER1_CPBS		(1 << 3)
/** TC0_IER1_CPAS RA Compare **/
#define TC0_IER1_CPAS		(1 << 2)
/** TC0_IER1_LOVRS Load Overrun **/
#define TC0_IER1_LOVRS		(1 << 1)
/** TC0_IER1_COVFS Counter Overflow **/
#define TC0_IER1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_idr1 IDR1 Interrupt Disable Register (channel = 1)
@{*/

/** TC0_IDR1_ETRGS External Trigger **/
#define TC0_IDR1_ETRGS		(1 << 7)
/** TC0_IDR1_LDRBS RB Loading **/
#define TC0_IDR1_LDRBS		(1 << 6)
/** TC0_IDR1_LDRAS RA Loading **/
#define TC0_IDR1_LDRAS		(1 << 5)
/** TC0_IDR1_CPCS RC Compare **/
#define TC0_IDR1_CPCS		(1 << 4)
/** TC0_IDR1_CPBS RB Compare **/
#define TC0_IDR1_CPBS		(1 << 3)
/** TC0_IDR1_CPAS RA Compare **/
#define TC0_IDR1_CPAS		(1 << 2)
/** TC0_IDR1_LOVRS Load Overrun **/
#define TC0_IDR1_LOVRS		(1 << 1)
/** TC0_IDR1_COVFS Counter Overflow **/
#define TC0_IDR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_imr1 IMR1 Interrupt Mask Register (channel = 1)
@{*/

/** TC0_IMR1_ETRGS External Trigger **/
#define TC0_IMR1_ETRGS		(1 << 7)
/** TC0_IMR1_LDRBS RB Loading **/
#define TC0_IMR1_LDRBS		(1 << 6)
/** TC0_IMR1_LDRAS RA Loading **/
#define TC0_IMR1_LDRAS		(1 << 5)
/** TC0_IMR1_CPCS RC Compare **/
#define TC0_IMR1_CPCS		(1 << 4)
/** TC0_IMR1_CPBS RB Compare **/
#define TC0_IMR1_CPBS		(1 << 3)
/** TC0_IMR1_CPAS RA Compare **/
#define TC0_IMR1_CPAS		(1 << 2)
/** TC0_IMR1_LOVRS Load Overrun **/
#define TC0_IMR1_LOVRS		(1 << 1)
/** TC0_IMR1_COVFS Counter Overflow **/
#define TC0_IMR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ccr2 CCR2 Channel Control Register (channel = 2)
@{*/

/** TC0_CCR2_SWTRG Software Trigger Command **/
#define TC0_CCR2_SWTRG		(1 << 2)
/** TC0_CCR2_CLKDIS Counter Clock Disable Command **/
#define TC0_CCR2_CLKDIS		(1 << 1)
/** TC0_CCR2_CLKEN Counter Clock Enable Command **/
#define TC0_CCR2_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cmr2 CMR2 Channel Mode Register (channel = 2)
@{*/


#define TC0_CMR2_LDRB_SHIFT		18
#define TC0_CMR2_LDRB_MASK		0x03
/** @defgroup tc0_cmr2_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC0_CMR2_LDRA_SHIFT		16
#define TC0_CMR2_LDRA_MASK		0x03
/** @defgroup tc0_cmr2_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC0_CMR2_WAVE Waveform Mode **/
#define TC0_CMR2_WAVE		(1 << 15)
/** TC0_CMR2_CPCTRG RC Compare Trigger Enable **/
#define TC0_CMR2_CPCTRG		(1 << 14)
/** TC0_CMR2_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC0_CMR2_ABETRG		(1 << 10)

#define TC0_CMR2_ETRGEDG_SHIFT		8
#define TC0_CMR2_ETRGEDG_MASK		0x03
/** @defgroup tc0_cmr2_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC0_CMR2_LDBDIS Counter Clock Disable with RB Loading **/
#define TC0_CMR2_LDBDIS		(1 << 7)
/** TC0_CMR2_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC0_CMR2_LDBSTOP		(1 << 6)

#define TC0_CMR2_BURST_SHIFT		4
#define TC0_CMR2_BURST_MASK		0x03
/** @defgroup tc0_cmr2_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR2_CLKI Clock Invert **/
#define TC0_CMR2_CLKI		(1 << 3)

#define TC0_CMR2_TCCLKS_SHIFT		0
#define TC0_CMR2_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr2_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_cmr2_waveform_mode CMR2WAVEFORMMODE Channel Mode Register (channel = 2)
@{*/


#define TC0_CMR2_WAVEFORM_MODE_BSWTRG_SHIFT		30
#define TC0_CMR2_WAVEFORM_MODE_BSWTRG_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_BEEVT_SHIFT		28
#define TC0_CMR2_WAVEFORM_MODE_BEEVT_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_BCPC_SHIFT		26
#define TC0_CMR2_WAVEFORM_MODE_BCPC_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_BCPB_SHIFT		24
#define TC0_CMR2_WAVEFORM_MODE_BCPB_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_ASWTRG_SHIFT		22
#define TC0_CMR2_WAVEFORM_MODE_ASWTRG_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_AEEVT_SHIFT		20
#define TC0_CMR2_WAVEFORM_MODE_AEEVT_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_ACPC_SHIFT		18
#define TC0_CMR2_WAVEFORM_MODE_ACPC_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_ACPA_SHIFT		16
#define TC0_CMR2_WAVEFORM_MODE_ACPA_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC0_CMR2_WAVEFORM_MODE_WAVE Waveform Mode **/
#define TC0_CMR2_WAVEFORM_MODE_WAVE		(1 << 15)

#define TC0_CMR2_WAVEFORM_MODE_WAVSEL_SHIFT		13
#define TC0_CMR2_WAVEFORM_MODE_WAVSEL_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC0_CMR2_WAVEFORM_MODE_ENETRG External Event Trigger Enable **/
#define TC0_CMR2_WAVEFORM_MODE_ENETRG		(1 << 12)

#define TC0_CMR2_WAVEFORM_MODE_EEVT_SHIFT		10
#define TC0_CMR2_WAVEFORM_MODE_EEVT_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC0_CMR2_WAVEFORM_MODE_EEVTEDG_SHIFT		8
#define TC0_CMR2_WAVEFORM_MODE_EEVTEDG_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC0_CMR2_WAVEFORM_MODE_CPCDIS Counter Clock Disable with RC Compare **/
#define TC0_CMR2_WAVEFORM_MODE_CPCDIS		(1 << 7)
/** TC0_CMR2_WAVEFORM_MODE_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC0_CMR2_WAVEFORM_MODE_CPCSTOP		(1 << 6)

#define TC0_CMR2_WAVEFORM_MODE_BURST_SHIFT		4
#define TC0_CMR2_WAVEFORM_MODE_BURST_MASK		0x03
/** @defgroup tc0_cmr2_waveform_mode_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR2_WAVEFORM_MODE_CLKI Clock Invert **/
#define TC0_CMR2_WAVEFORM_MODE_CLKI		(1 << 3)

#define TC0_CMR2_WAVEFORM_MODE_TCCLKS_SHIFT		0
#define TC0_CMR2_WAVEFORM_MODE_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr2_waveform_mode_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_smmr2 SMMR2 Stepper Motor Mode Register (channel = 2)
@{*/

/** TC0_SMMR2_DOWN Down Count **/
#define TC0_SMMR2_DOWN		(1 << 1)
/** TC0_SMMR2_GCEN Gray Count Enable **/
#define TC0_SMMR2_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cv2 CV2 Counter Value (channel = 2)
@{*/


#define TC0_CV2_CV_SHIFT		0
#define TC0_CV2_CV_MASK		0xffffffff
/** @defgroup tc0_cv2_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

