grevaillot/svd_tools/headers/ATSAM4SD16C/tc0.h
/** @defgroup tc0_ra2 RA2 Register A (channel = 2)
@{*/


#define TC0_RA2_RA_SHIFT		0
#define TC0_RA2_RA_MASK		0xffffffff
/** @defgroup tc0_ra2_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rb2 RB2 Register B (channel = 2)
@{*/


#define TC0_RB2_RB_SHIFT		0
#define TC0_RB2_RB_MASK		0xffffffff
/** @defgroup tc0_rb2_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rc2 RC2 Register C (channel = 2)
@{*/


#define TC0_RC2_RC_SHIFT		0
#define TC0_RC2_RC_MASK		0xffffffff
/** @defgroup tc0_rc2_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_sr2 SR2 Status Register (channel = 2)
@{*/

/** TC0_SR2_MTIOB TIOB Mirror **/
#define TC0_SR2_MTIOB		(1 << 18)
/** TC0_SR2_MTIOA TIOA Mirror **/
#define TC0_SR2_MTIOA		(1 << 17)
/** TC0_SR2_CLKSTA Clock Enabling Status **/
#define TC0_SR2_CLKSTA		(1 << 16)
/** TC0_SR2_ETRGS External Trigger Status (cleared on read) **/
#define TC0_SR2_ETRGS		(1 << 7)
/** TC0_SR2_LDRBS RB Loading Status (cleared on read) **/
#define TC0_SR2_LDRBS		(1 << 6)
/** TC0_SR2_LDRAS RA Loading Status (cleared on read) **/
#define TC0_SR2_LDRAS		(1 << 5)
/** TC0_SR2_CPCS RC Compare Status (cleared on read) **/
#define TC0_SR2_CPCS		(1 << 4)
/** TC0_SR2_CPBS RB Compare Status (cleared on read) **/
#define TC0_SR2_CPBS		(1 << 3)
/** TC0_SR2_CPAS RA Compare Status (cleared on read) **/
#define TC0_SR2_CPAS		(1 << 2)
/** TC0_SR2_LOVRS Load Overrun Status (cleared on read) **/
#define TC0_SR2_LOVRS		(1 << 1)
/** TC0_SR2_COVFS Counter Overflow Status (cleared on read) **/
#define TC0_SR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ier2 IER2 Interrupt Enable Register (channel = 2)
@{*/

/** TC0_IER2_ETRGS External Trigger **/
#define TC0_IER2_ETRGS		(1 << 7)
/** TC0_IER2_LDRBS RB Loading **/
#define TC0_IER2_LDRBS		(1 << 6)
/** TC0_IER2_LDRAS RA Loading **/
#define TC0_IER2_LDRAS		(1 << 5)
/** TC0_IER2_CPCS RC Compare **/
#define TC0_IER2_CPCS		(1 << 4)
/** TC0_IER2_CPBS RB Compare **/
#define TC0_IER2_CPBS		(1 << 3)
/** TC0_IER2_CPAS RA Compare **/
#define TC0_IER2_CPAS		(1 << 2)
/** TC0_IER2_LOVRS Load Overrun **/
#define TC0_IER2_LOVRS		(1 << 1)
/** TC0_IER2_COVFS Counter Overflow **/
#define TC0_IER2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_idr2 IDR2 Interrupt Disable Register (channel = 2)
@{*/

/** TC0_IDR2_ETRGS External Trigger **/
#define TC0_IDR2_ETRGS		(1 << 7)
/** TC0_IDR2_LDRBS RB Loading **/
#define TC0_IDR2_LDRBS		(1 << 6)
/** TC0_IDR2_LDRAS RA Loading **/
#define TC0_IDR2_LDRAS		(1 << 5)
/** TC0_IDR2_CPCS RC Compare **/
#define TC0_IDR2_CPCS		(1 << 4)
/** TC0_IDR2_CPBS RB Compare **/
#define TC0_IDR2_CPBS		(1 << 3)
/** TC0_IDR2_CPAS RA Compare **/
#define TC0_IDR2_CPAS		(1 << 2)
/** TC0_IDR2_LOVRS Load Overrun **/
#define TC0_IDR2_LOVRS		(1 << 1)
/** TC0_IDR2_COVFS Counter Overflow **/
#define TC0_IDR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_imr2 IMR2 Interrupt Mask Register (channel = 2)
@{*/

/** TC0_IMR2_ETRGS External Trigger **/
#define TC0_IMR2_ETRGS		(1 << 7)
/** TC0_IMR2_LDRBS RB Loading **/
#define TC0_IMR2_LDRBS		(1 << 6)
/** TC0_IMR2_LDRAS RA Loading **/
#define TC0_IMR2_LDRAS		(1 << 5)
/** TC0_IMR2_CPCS RC Compare **/
#define TC0_IMR2_CPCS		(1 << 4)
/** TC0_IMR2_CPBS RB Compare **/
#define TC0_IMR2_CPBS		(1 << 3)
/** TC0_IMR2_CPAS RA Compare **/
#define TC0_IMR2_CPAS		(1 << 2)
/** TC0_IMR2_LOVRS Load Overrun **/
#define TC0_IMR2_LOVRS		(1 << 1)
/** TC0_IMR2_COVFS Counter Overflow **/
#define TC0_IMR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_bcr BCR Block Control Register
@{*/

/** TC0_BCR_SYNC Synchro Command **/
#define TC0_BCR_SYNC		(1 << 0)

/**@}*/

/** @defgroup tc0_bmr BMR Block Mode Register
@{*/


#define TC0_BMR_MAXFILT_SHIFT		20
#define TC0_BMR_MAXFILT_MASK		0x3f
/** @defgroup tc0_bmr_maxfilt MAXFILT Maximum Filter
@{*/
/**@}*/

/** TC0_BMR_IDXPHB Index Pin is PHB Pin **/
#define TC0_BMR_IDXPHB		(1 << 17)
/** TC0_BMR_SWAP Swap PHA and PHB **/
#define TC0_BMR_SWAP		(1 << 16)
/** TC0_BMR_INVIDX Inverted Index **/
#define TC0_BMR_INVIDX		(1 << 15)
/** TC0_BMR_INVB Inverted PHB **/
#define TC0_BMR_INVB		(1 << 14)
/** TC0_BMR_INVA Inverted PHA **/
#define TC0_BMR_INVA		(1 << 13)
/** TC0_BMR_EDGPHA Edge on PHA Count Mode **/
#define TC0_BMR_EDGPHA		(1 << 12)
/** TC0_BMR_QDTRANS Quadrature Decoding Transparent **/
#define TC0_BMR_QDTRANS		(1 << 11)
/** TC0_BMR_SPEEDEN Speed Enabled **/
#define TC0_BMR_SPEEDEN		(1 << 10)
/** TC0_BMR_POSEN Position Enabled **/
#define TC0_BMR_POSEN		(1 << 9)
/** TC0_BMR_QDEN Quadrature Decoder Enabled **/
#define TC0_BMR_QDEN		(1 << 8)

#define TC0_BMR_TC2XC2S_SHIFT		4
#define TC0_BMR_TC2XC2S_MASK		0x03
/** @defgroup tc0_bmr_tc2xc2s TC2XC2S External Clock Signal 2 Selection
@{*/
/**@}*/


#define TC0_BMR_TC1XC1S_SHIFT		2
#define TC0_BMR_TC1XC1S_MASK		0x03
/** @defgroup tc0_bmr_tc1xc1s TC1XC1S External Clock Signal 1 Selection
@{*/
/**@}*/


#define TC0_BMR_TC0XC0S_SHIFT		0
#define TC0_BMR_TC0XC0S_MASK		0x03
/** @defgroup tc0_bmr_tc0xc0s TC0XC0S External Clock Signal 0 Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_qier QIER QDEC Interrupt Enable Register
@{*/

/** TC0_QIER_QERR Quadrature Error **/
#define TC0_QIER_QERR		(1 << 2)
/** TC0_QIER_DIRCHG Direction Change **/
#define TC0_QIER_DIRCHG		(1 << 1)
/** TC0_QIER_IDX Index **/
#define TC0_QIER_IDX		(1 << 0)

/**@}*/

/** @defgroup tc0_qidr QIDR QDEC Interrupt Disable Register
@{*/

/** TC0_QIDR_QERR Quadrature Error **/
#define TC0_QIDR_QERR		(1 << 2)
/** TC0_QIDR_DIRCHG Direction Change **/
#define TC0_QIDR_DIRCHG		(1 << 1)
/** TC0_QIDR_IDX Index **/
#define TC0_QIDR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc0_qimr QIMR QDEC Interrupt Mask Register
@{*/

/** TC0_QIMR_QERR Quadrature Error **/
#define TC0_QIMR_QERR		(1 << 2)
/** TC0_QIMR_DIRCHG Direction Change **/
#define TC0_QIMR_DIRCHG		(1 << 1)
/** TC0_QIMR_IDX Index **/
#define TC0_QIMR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc0_qisr QISR QDEC Interrupt Status Register
@{*/

/** TC0_QISR_DIR Direction **/
#define TC0_QISR_DIR		(1 << 8)
/** TC0_QISR_QERR Quadrature Error **/
#define TC0_QISR_QERR		(1 << 2)
/** TC0_QISR_DIRCHG Direction Change **/
#define TC0_QISR_DIRCHG		(1 << 1)
/** TC0_QISR_IDX Index **/
#define TC0_QISR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc0_fmr FMR Fault Mode Register
@{*/

/** TC0_FMR_ENCF1 Enable Compare Fault Channel 1 **/
#define TC0_FMR_ENCF1		(1 << 1)
/** TC0_FMR_ENCF0 Enable Compare Fault Channel 0 **/
#define TC0_FMR_ENCF0		(1 << 0)

/**@}*/

/** @defgroup tc0_wpmr WPMR Write Protection Mode Register
@{*/


#define TC0_WPMR_WPKEY_SHIFT		8
#define TC0_WPMR_WPKEY_MASK		0xffffff
/** @defgroup tc0_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** TC0_WPMR_WPEN Write Protection Enable **/
#define TC0_WPMR_WPEN		(1 << 0)

/**@}*/
